# Element Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..Element Property
Parameter Class See Also
---
The element to which this parameter belongs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Element Element { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Element As Element
	Get
```

Visual C++
---
```text
public:
property Element^ Element {
	Element^ get ();
}
```

# See Also
Parameter Class
Autodesk.Revit.DB Namespace